[Killed] MethodExpression
main/components/Nav/AppNavbar.js:14:9
 }) {
   return (
     <>
-      {(currentUrl.startsWith('http://localhost:3000') ||
+      {(currentUrl.endsWith('http://localhost:3000') ||
         currentUrl.startsWith('http://127.0.0.1:3000')) && (
         <AppNavbarLocalhost url={currentUrl} />
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:14:8
 }) {
   return (
     <>
-      {(currentUrl.startsWith('http://localhost:3000') ||
-        currentUrl.startsWith('http://127.0.0.1:3000')) && (
-        <AppNavbarLocalhost url={currentUrl} />
-      )}
+      {true}
       <Navbar
         expand="xl"
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] MethodExpression
main/components/Nav/AppNavbar.js:15:9
   return (
     <>
       {(currentUrl.startsWith('http://localhost:3000') ||
-        currentUrl.startsWith('http://127.0.0.1:3000')) && (
+        currentUrl.endsWith('http://127.0.0.1:3000')) && (
         <AppNavbarLocalhost url={currentUrl} />
       )}
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://127.0.0.1:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:33:14
           <Navbar.Toggle />
 
           <Nav className="me-auto">
-            {systemInfo?.springH2ConsoleEnabled && (
-              <>
-                <Nav.Link href="/h2-console">H2Console</Nav.Link>
-              </>
-            )}
+            {systemInfo?.springH2ConsoleEnabled || <>
+                <Nav.Link href="/h2-console">H2Console</Nav.Link>
+              </>}
             {systemInfo?.showSwaggerUILink && (
               <>
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Error: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:51:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, 'ROLE_ADMIN') && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {hasRole(currentUser, 'ROLE_ADMIN') || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
+                </NavDropdown>}
             </Nav>
             {currentUser && currentUser.loggedIn && (
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:51:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, 'ROLE_ADMIN') && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {true}
             </Nav>
             {currentUser && currentUser.loggedIn && (
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:61:14
                 </NavDropdown>
               )}
             </Nav>
-            {currentUser && currentUser.loggedIn && (
-              <>
-                <Nav.Link as={Link} to="/restaurants">
-                  Restaurants
-                </Nav.Link>
-                <Nav.Link as={Link} to="/ucsbdates">
-                  UCSB Dates
-                </Nav.Link>
-                <Nav.Link as={Link} to="/placeholder">
-                  Placeholder
-                </Nav.Link>
-                <Nav.Link as={Link} to="/menuitemreview">
-                  Menu Item Reviews
-                </Nav.Link>
-              </>
-            )}
+            {currentUser && currentUser.loggedIn || <>
+                <Nav.Link as={Link} to="/restaurants">
+                  Restaurants
+                </Nav.Link>
+                <Nav.Link as={Link} to="/ucsbdates">
+                  UCSB Dates
+                </Nav.Link>
+                <Nav.Link as={Link} to="/placeholder">
+                  Placeholder
+                </Nav.Link>
+                <Nav.Link as={Link} to="/menuitemreview">
+                  Menu Item Reviews
+                </Nav.Link>
+              </>}
             <Nav className="ml-auto">
               {currentUser && currentUser.loggedIn ? (
killedBy: AppNavbar tests renders the ucsbdates link correctly
statusReason: Error: Unable to find an element with the text: UCSB Dates. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:61:14
                 </NavDropdown>
               )}
             </Nav>
-            {currentUser && currentUser.loggedIn && (
-              <>
-                <Nav.Link as={Link} to="/restaurants">
-                  Restaurants
-                </Nav.Link>
-                <Nav.Link as={Link} to="/ucsbdates">
-                  UCSB Dates
-                </Nav.Link>
-                <Nav.Link as={Link} to="/placeholder">
-                  Placeholder
-                </Nav.Link>
-                <Nav.Link as={Link} to="/menuitemreview">
-                  Menu Item Reviews
-                </Nav.Link>
-              </>
-            )}
+            {true}
             <Nav className="ml-auto">
               {currentUser && currentUser.loggedIn ? (
killedBy: AppNavbar tests renders the ucsbdates link correctly
statusReason: Error: Unable to find an element with the text: UCSB Dates. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
