[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:8:17
 function MenuItemReviewForm({
   initialContents,
   submitAction,
-  buttonLabel = 'Create',
+  buttonLabel = "",
 }) {
   // Stryker disable all
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:31:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="MenuItemReviewForm-id"
-                id="id"
-                type="text"
-                {...register('id')}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         <Col>
killedBy: MenuItemReviewForm tests renders correctly when passing in a MenuItemReview
statusReason: Error: Unable to find an element by: [data-testid="/MenuItemReviewForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:31:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="MenuItemReviewForm-id"
-                id="id"
-                type="text"
-                {...register('id')}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: MenuItemReviewForm tests renders correctly when passing in a MenuItemReview
statusReason: Error: Unable to find an element by: [data-testid="/MenuItemReviewForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:39:30
                 data-testid="MenuItemReviewForm-id"
                 id="id"
                 type="text"
-                {...register('id')}
+                {...register("")}
                 value={initialContents.id}
                 disabled
killedBy: MenuItemReviewForm tests renders correctly when passing in a MenuItemReview
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:55:38
               id="itemId"
               type="text"
               isInvalid={Boolean(errors.itemId)}
-              {...register('itemId', {
-                required: true,
-              })}
+              {...register('itemId', {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /itemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:55:28
               id="itemId"
               type="text"
               isInvalid={Boolean(errors.itemId)}
-              {...register('itemId', {
+              {...register("", {
                 required: true,
               })}
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:56:27
               type="text"
               isInvalid={Boolean(errors.itemId)}
               {...register('itemId', {
-                required: true,
+                required: false,
               })}
             />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /itemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:60:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.itemId && 'itemId is required.'}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /itemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:60:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.itemId && 'itemId is required.'}
+              {errors.itemId || 'itemId is required.'}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:73:44
               id="dateReviewed"
               type="datetime-local"
               isInvalid={Boolean(errors.dateReviewed)}
-              {...register('dateReviewed', {
-                required: true,
-                pattern: isodate_regex,
-              })}
+              {...register('dateReviewed', {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Date Reviewed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:74:27
               type="datetime-local"
               isInvalid={Boolean(errors.dateReviewed)}
               {...register('dateReviewed', {
-                required: true,
+                required: false,
                 pattern: isodate_regex,
               })}
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Date Reviewed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:94:28
               id="reviewerEmail"
               type="text"
               isInvalid={Boolean(errors.reviewerEmail)}
-              {...register('reviewerEmail', {
+              {...register("", {
                 required: 'Reviewer Email is required.',
               })}
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:114:28
               id="stars"
               type="text"
               isInvalid={Boolean(errors.stars)}
-              {...register('stars', {
+              {...register("", {
                 required: true,
               })}
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:114:37
               id="stars"
               type="text"
               isInvalid={Boolean(errors.stars)}
-              {...register('stars', {
-                required: true,
-              })}
+              {...register('stars', {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:115:27
               type="text"
               isInvalid={Boolean(errors.stars)}
               {...register('stars', {
-                required: true,
+                required: false,
               })}
             />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:119:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.stars && 'Stars is required.'}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
