[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:61:14
                 </NavDropdown>
               )}
             </Nav>
-            {currentUser && currentUser.loggedIn && (
-              <>
-                <Nav.Link as={Link} to="/restaurants">
-                  Restaurants
-                </Nav.Link>
-                <Nav.Link as={Link} to="/ucsbdates">
-                  UCSB Dates
-                </Nav.Link>
-                <Nav.Link as={Link} to="/placeholder">
-                  Placeholder
-                </Nav.Link>
-                <Nav.Link as={Link} to="/organizations">
-                  UCSB Organizations
-                </Nav.Link>
-              </>
-            )}
+            {true}
 
             <Nav className="ml-auto">
killedBy: AppNavbar tests renders the ucsbdates link correctly
statusReason: Error: Unable to find an element with the text: UCSB Dates. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:61:14
                 </NavDropdown>
               )}
             </Nav>
-            {currentUser && currentUser.loggedIn && (
+            {true && (
               <>
                 <Nav.Link as={Link} to="/restaurants">
killedBy: AppNavbar tests Restaurant and UCSBDates links do NOT show when not logged in
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="nav-link" href="/restaurants">Restaurants</a> instead
