[Killed] BlockStatement
main/components/MenuItemReview/MenuItemReviewTable.js:15:34
 export default function MenuItemReviewTable({ menuItemReviews, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/MenuItemReview/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/MenuItemReview/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:45:15
       accessor: 'itemId',
     },
     {
-      Header: 'reviewerEmail',
+      Header: "",
       accessor: 'reviewerEmail',
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: reviewerEmail. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:48:5
       Header: 'reviewerEmail',
       accessor: 'reviewerEmail',
     },
-    {
-      Header: 'stars',
-      accessor: 'stars',
-    },
+    {},
     {
       Header: 'dateReviewed',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/MenuItemReview/MenuItemReviewTable.js:62:43
     },
   ];
 
-  if (hasRole(currentUser, 'ROLE_ADMIN')) {
-    columns.push(
-      ButtonColumn('Edit', 'primary', editCallback, 'MenuItemReviewTable')
-    );
-    columns.push(
-      ButtonColumn('Delete', 'danger', deleteCallback, 'MenuItemReviewTable')
-    );
-  }
+  if (hasRole(currentUser, 'ROLE_ADMIN')) {}
 
   return (
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewTable.js:62:7
     },
   ];
 
-  if (hasRole(currentUser, 'ROLE_ADMIN')) {
+  if (false) {
     columns.push(
       ButtonColumn('Edit', 'primary', editCallback, 'MenuItemReviewTable')
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:64:28
 
   if (hasRole(currentUser, 'ROLE_ADMIN')) {
     columns.push(
-      ButtonColumn('Edit', 'primary', editCallback, 'MenuItemReviewTable')
+      ButtonColumn('Edit', "", editCallback, 'MenuItemReviewTable')
     );
     columns.push(
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
