[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:8:31
 import { toast } from 'react-toastify';
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (MenuItemReview) => ({
-    url: '/api/MenuItemReview/post',
-    method: 'POST',
-    params: {
-      itemId: MenuItemReview.itemId,
-      reviewerEmail: MenuItemReview.reviewerEmail,
-      stars: MenuItemReview.stars,
-      comments: MenuItemReview.comments,
-      dateReviewed: MenuItemReview.dateReviewed,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (MenuItemReview) => {
killedBy: MenuItemReviewCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:20:41
     },
   });
 
-  const onSuccess = (MenuItemReview) => {
-    toast(
-      `New MenuItemReview Created - id: ${MenuItemReview.id} itemId: ${MenuItemReview.itemId}`
-    );
-  };
+  const onSuccess = (MenuItemReview) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New MenuItemReview Created - id: 1 itemId: 101"

Number of calls: 0
