[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:12:30
 export default function MenuItemReviewIndexPage() {
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, 'ROLE_ADMIN')) {
-      return (
-        <Button
-          variant="primary"
-          href="/menuitemreview/create"
-          style={{ float: 'right' }}
-        >
-          Create Menu Item Review
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   const {
killedBy: MenuItemReviewIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Menu Item Review/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:13:45
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, 'ROLE_ADMIN')) {
-      return (
-        <Button
-          variant="primary"
-          href="/menuitemreview/create"
-          style={{ float: 'right' }}
-        >
-          Create Menu Item Review
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, 'ROLE_ADMIN')) {}
   };
 
killedBy: MenuItemReviewIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Menu Item Review/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:13:9
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, 'ROLE_ADMIN')) {
+    if (true) {
       return (
         <Button
killedBy: MenuItemReviewIndexPage tests renders three dates correctly for regular user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="btn btn-primary" href="/menuitemreview/create" role="button" style="float: right;" tabindex="0">Create Menu Item Review</a> instead

[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:33:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ['/api/MenuItemReview/all'],
-    { method: 'GET', url: '/api/MenuItemReview/all' },
+    {},
     []
   );
killedBy: MenuItemReviewIndexPage tests renders three dates correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrayDeclaration
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:34:5
     // Stryker disable next-line all : don't test internal caching of React Query
     ['/api/MenuItemReview/all'],
     { method: 'GET', url: '/api/MenuItemReview/all' },
-    []
+    ["Stryker was here"]
   );
 
killedBy: MenuItemReviewIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="MenuItemReviewTable-cell-row-0-col-id" role="cell" /> instead
