[Killed] BlockStatement
src/main/utils/MenuItemReviewUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: '/api/MenuItemReview',
-    method: 'DELETE',
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: MenuItemReviewIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "MenuItemReview with id 2 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
src/main/utils/MenuItemReviewUtils.js:11:13
 export function cellToAxiosParamsDelete(cell) {
   return {
     url: '/api/MenuItemReview',
-    method: 'DELETE',
+    method: "",
     params: {
       id: cell.row.values.id,
killedBy: MenuItemReviewIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "MenuItemReview with id 2 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
src/main/utils/MenuItemReviewUtils.js:12:13
   return {
     url: '/api/MenuItemReview',
     method: 'DELETE',
-    params: {
-      id: cell.row.values.id,
-    },
+    params: {},
   };
 }
killedBy: MenuItemReviewUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Object {
    "method": "DELETE",
-   "params": Object {
