[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:13:70
 // private String explanation;
 // private String email;
 // private LocalDateTime dateAdded;
-function ArticlesForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function ArticlesForm({ initialContents, submitAction, buttonLabel = "" }) {
 
     
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: TestingLibraryElementError: Unable to find an element with the text: Create. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:56:37
                     isInvalid={Boolean(errors.title)}
                     {...register("title", {
                         required: "Title is required.",
-                        maxLength : {
-                            value: 30,
-                            message: "Max length 30 characters"
-                        }
+                        maxLength : {}
                     })}
                 />
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:58:38
                         required: "Title is required.",
                         maxLength : {
                             value: 30,
-                            message: "Max length 30 characters"
+                            message: ""
                         }
                     })}
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
