[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:25:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/articles/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: ArticlesTables tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/articles/edit/2"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:52:23
         },
         {
             Header: 'URL',
-            accessor: 'url',
+            accessor: "",
         },
 
killedBy: ArticlesTables tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-url"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.js:55:9
             accessor: 'url',
         },
 
-        {
-            Header: 'Explanation',
-            accessor: 'explanation',
-        },
+        {},
 
         {
killedBy: ArticlesTables tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
