[Killed] BooleanLiteral
main/pages/Articles/ArticlesCreatePage.js:15:55
 // private String explanation;
 // private String email;
 // private LocalDateTime dateAdded;
-export default function ArticlesCreatePage({storybook=false}) {
+export default function ArticlesCreatePage({storybook=true}) {
 
   const objectToAxiosParams = (articles) => ({
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/articles"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/Articles/ArticlesCreatePage.js:17:31
 // private LocalDateTime dateAdded;
 export default function ArticlesCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (articles) => ({
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-     title: articles.title,
-     url: articles.url,
-     explanation: articles.explanation,
-     email: articles.email,
-     dateAdded: articles.dateAdded
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (articles) => {
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Articles/ArticlesCreatePage.js:17:46
 // private LocalDateTime dateAdded;
 export default function ArticlesCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (articles) => ({
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-     title: articles.title,
-     url: articles.url,
-     explanation: articles.explanation,
-     email: articles.email,
-     dateAdded: articles.dateAdded
-    }
-  });
+  const objectToAxiosParams = (articles) => ({});
 
   const onSuccess = (articles) => {
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.js:29:35
     }
   });
 
-  const onSuccess = (articles) => {
-    toast(`New articles Created - id: ${articles.id} title: ${articles.title}`);
-  }
+  const onSuccess = (articles) => {}
 
   const mutation = useBackendMutation(
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New articles Created - id: 3 title: Apple 16-inch M3 Max"

Number of calls: 0

[Killed] StringLiteral
main/pages/Articles/ArticlesCreatePage.js:30:11
   });
 
   const onSuccess = (articles) => {
-    toast(`New articles Created - id: ${articles.id} title: ${articles.title}`);
+    toast(``);
   }
 
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New articles Created - id: 3 title: Apple 16-inch M3 Max"
Received: ""

Number of calls: 1
