[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:68:47
           id="orgTranslationShort"
           type="text"
           isInvalid={Boolean(errors.description)}
-          {...register("orgTranslationShort", {
-            required: "orgTranslationShort is required.",
-          })}
+          {...register("orgTranslationShort", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganization tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /orgTranslationShort is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:68:24
           id="orgTranslationShort"
           type="text"
           isInvalid={Boolean(errors.description)}
-          {...register("orgTranslationShort", {
+          {...register("", {
             required: "orgTranslationShort is required.",
           })}
killedBy: OrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:85:42
           id="orgTranslation"
           type="text"
           isInvalid={Boolean(errors.description)}
-          {...register("orgTranslation", {
-            required: "orgTranslation is required.",
-          })}
+          {...register("orgTranslation", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganization tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /orgTranslation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:85:24
           id="orgTranslation"
           type="text"
           isInvalid={Boolean(errors.description)}
-          {...register("orgTranslation", {
+          {...register("", {
             required: "orgTranslation is required.",
           })}
killedBy: OrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:102:36
           id="inactive"
           type="text"
           isInvalid={Boolean(errors.description)}
-          {...register("inactive", {
-            required: "inactive is required.",
-          })}
+          {...register("inactive", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganization tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /inactive is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
