[Killed] BooleanLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:8:60
 import { toast } from "react-toastify";
 import OrganizationForm from "main/components/UCSBOrganization/UCSBOrganizationForm";
 
-export default function OrganizationEditPage({ storybook = false }) {
+export default function OrganizationEditPage({ storybook = true }) {
   let { orgCode } = useParams();
 
killedBy: OrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/organizations"}

Number of calls: 0

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:22:15
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/organizations`,
-      params: {
-        orgCode,
-      },
+      params: {},
     }
   );
killedBy: OrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="OrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:28:34
     }
   );
 
-  const objectToAxiosPutParams = (organization) => ({
-    url: "/api/organizations",
-    method: "PUT",
-    params: {
-      orgCode: organization.orgCode,
-    },
-    data: {
-      orgCode: organization.orgCode,
-      orgTranslationShort: organization.orgTranslationShort,
-      orgTranslation: organization.orgTranslation,
-      inactive: organization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (organization) => {
killedBy: OrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Organization Updated - orgCode: zpr orgTranslationShort: zeta phi rho orgTranslation: zeta-phi-rho inactive: false"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:28:53
     }
   );
 
-  const objectToAxiosPutParams = (organization) => ({
-    url: "/api/organizations",
-    method: "PUT",
-    params: {
-      orgCode: organization.orgCode,
-    },
-    data: {
-      orgCode: organization.orgCode,
-      orgTranslationShort: organization.orgTranslationShort,
-      orgTranslation: organization.orgTranslation,
-      inactive: organization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = (organization) => ({});
 
   const onSuccess = (organization) => {
killedBy: OrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Organization Updated - orgCode: zpr orgTranslationShort: zeta phi rho orgTranslation: zeta-phi-rho inactive: false"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] LogicalOperator
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Organization</h1>
-        {organization && (
-          <OrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={organization}
-          />
-        )}
+        {organization || <OrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={organization} />}
       </div>
     </BasicLayout>
killedBy: OrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="OrganizationForm-orgCode"]

<body>
  <div />
</body>

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Organization</h1>
-        {organization && (
-          <OrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={organization}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: OrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="OrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
