[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:19:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/organizations/all"],
-    { method: "GET", url: "/api/organizations/all" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     []
killedBy: UCSBOrganizationIndexPage tests renders three organizations correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="OrganizationTable-cell-row-0-col-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:19:27
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/organizations/all"],
-    { method: "GET", url: "/api/organizations/all" },
+    { method: "GET", url: "" },
     // Stryker disable next-line all : don't test default value of empty list
     []
killedBy: UCSBOrganizationIndexPage tests renders three organizations correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="OrganizationTable-cell-row-0-col-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:24:30
     []
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/organizations/create"
-          style={{ float: "right" }}
-        >
-          Create Organization
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Organization/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:25:45
   );
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/organizations/create"
-          style={{ float: "right" }}
-        >
-          Create Organization
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Organization/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:30:18
         <Button
           variant="primary"
           href="/organizations/create"
-          style={{ float: "right" }}
+          style={{}}
         >
           Create Organization
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
