[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:38:9
             accessor: 'id', // accessor is the "key" in the data
         },
 
-        {
-            Header: 'Dining commons code',
-            accessor: 'diningCommonsCode',
-        },
+        {},
         {
             Header: 'Name',
killedBy: UCSBDiningCommonsMenuItemIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:39:21
         },
 
         {
-            Header: 'Dining commons code',
+            Header: "",
             accessor: 'diningCommonsCode',
         },
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Dining commons code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:40:23
 
         {
             Header: 'Dining commons code',
-            accessor: 'diningCommonsCode',
+            accessor: "",
         },
         {
killedBy: UCSBDiningCommonsMenuItemTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-diningCommonsCode"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
