[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:18:17
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
         url: `/api/ucsbdiningcommonsmenuitems`,
-        params: {
-          id
-        }
+        params: {}
       }
     );
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (UCSBDiningCommonsMenuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitems",
-    method: "PUT",
-    params: {
-      id: UCSBDiningCommonsMenuItem.id,
-    },
-    data: {
-      name: UCSBDiningCommonsMenuItem.name,
-      diningCommonsCode: UCSBDiningCommonsMenuItem.diningCommonsCode,
-      station: UCSBDiningCommonsMenuItem.station
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (UCSBDiningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDiningCommonsMenuItem Updated - id: 17 name: cheeseburger diningCommonsCode: ortega station: entree"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:64:11
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItem</h1>
         {
-          UCSBDiningCommonsMenuItem && <UCSBDiningCommonsMenuItemForm initialContents={UCSBDiningCommonsMenuItem} submitAction={onSubmit} buttonLabel="Update" />
+          false
         }
       </div>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:64:11
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItem</h1>
         {
-          UCSBDiningCommonsMenuItem && <UCSBDiningCommonsMenuItemForm initialContents={UCSBDiningCommonsMenuItem} submitAction={onSubmit} buttonLabel="Update" />
+          UCSBDiningCommonsMenuItem || <UCSBDiningCommonsMenuItemForm initialContents={UCSBDiningCommonsMenuItem} submitAction={onSubmit} buttonLabel="Update" />
         }
       </div>
killedBy: UCSBDiningCommonsMenuItemEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="UCSBDiningCommonsMenuItemForm-name" id="name" name="name" type="text" /> instead
